app/Controllers/Home.php

SELECT *
FROM `tb_menu`
WHERE `kategori` = 'Minuman'
SELECT *
FROM `tb_menu`
WHERE `kategori` = 'Makanan'
---
    public function index()
    {
        $menuModel = new MenuModel();
        $minuman = $menuModel->where('kategori','Minuman')->findAll();
        $makanan = $menuModel->where('kategori','Makanan')->findAll();